# Datetime and Window Function in Pandas

In [146]:
import pandas as pd
import numpy as np

In [148]:
df = pd.read_csv("Desktop/Sakshi/Business Analyst/Live lectures/Data Analyst Tools (python libraries)/2 Pandas/9 Datetime & Plots in Pandas/Electric_Production.csv")

In [150]:
df.head()

         DATE    Value
0  01-01-1985  72.5052
1  02-01-1985  70.6720
2  03-01-1985  62.4502
3  04-01-1985  57.4714
4  05-01-1985  55.3151

In [152]:
df.shape

(397, 2)

In [154]:
df.dtypes

DATE      object
Value    float64
dtype: object

In [156]:
df.isnull().sum()

DATE     0
Value    0
dtype: int64

## Change the data type of date to Dataframe

In [158]:
df['DATE'] = pd.to_datetime(df['DATE'])   # object to datetime data type conversion
df.dtypes

DATE     datetime64[ns]
Value           float64
dtype: object

In [160]:
# The changes made in the original (df) dataframe will not be reflected 
# in the copy of the dataframe (df1)
df1 = df.copy()

#### Q) Extract year, quarter, month, day and weekday from the date column in the df dataframe and store them as separate columns in df dataframe.

In [162]:
# dt = datetime
df['Year'] = df['DATE'].dt.year        # year extraction 
df['Quarter'] = df['DATE'].dt.quarter     # quarter extraction 
df['Month'] = df['DATE'].dt.month      # month extraction 
df['Day'] = df['DATE'].dt.day            # day extraction 
df['Weekday'] = df['DATE'].dt.weekday      # weekday extraction 
df.head()

        DATE    Value  Year  Quarter  Month  Day  Weekday
0 1985-01-01  72.5052  1985        1      1    1        1
1 1985-02-01  70.6720  1985        1      2    1        4
2 1985-03-01  62.4502  1985        1      3    1        4
3 1985-04-01  57.4714  1985        2      4    1        0
4 1985-05-01  55.3151  1985        2      5    1        2

In [164]:
df.tail()

          DATE     Value  Year  Quarter  Month  Day  Weekday
392 2017-09-01   98.6154  2017        3      9    1        4
393 2017-10-01   93.6137  2017        4     10    1        6
394 2017-11-01   97.3359  2017        4     11    1        2
395 2017-12-01  114.7212  2017        4     12    1        4
396 2018-01-01  129.4048  2018        1      1    1        0

In [166]:
df1.head()

        DATE    Value
0 1985-01-01  72.5052
1 1985-02-01  70.6720
2 1985-03-01  62.4502
3 1985-04-01  57.4714
4 1985-05-01  55.3151

In [168]:
df1.dtypes

DATE     datetime64[ns]
Value           float64
dtype: object

### Extract year, quarter, month and day in df1 using lambda function

In [171]:
df1['Year'] = df1['DATE'].apply(lambda x : x.year)
df1['Quarter'] = df1['DATE'].apply(lambda x : x.quarter)
df1['Month'] = df1['DATE'].apply(lambda x : x.month)
df1['Day'] = df1['DATE'].apply(lambda x : x.day)
df1.head()

        DATE    Value  Year  Quarter  Month  Day
0 1985-01-01  72.5052  1985        1      1    1
1 1985-02-01  70.6720  1985        1      2    1
2 1985-03-01  62.4502  1985        1      3    1
3 1985-04-01  57.4714  1985        2      4    1
4 1985-05-01  55.3151  1985        2      5    1

In [173]:
df2 = df1[['DATE','Value']]
df2.head()

        DATE    Value
0 1985-01-01  72.5052
1 1985-02-01  70.6720
2 1985-03-01  62.4502
3 1985-04-01  57.4714
4 1985-05-01  55.3151

In [175]:
df2 = df2.set_index('DATE')
df2.head()

              Value
DATE
1985-01-01  72.5052
1985-02-01  70.6720
1985-03-01  62.4502
1985-04-01  57.4714
1985-05-01  55.3151

In [186]:
print(df2.columns)
print(df2.index)

Index(['Value'], dtype='object')
DatetimeIndex(['1985-01-01', '1985-02-01', '1985-03-01', '1985-04-01',
               '1985-05-01', '1985-06-01', '1985-07-01', '1985-08-01',
               '1985-09-01', '1985-10-01',
               ...
               '2017-04-01', '2017-05-01', '2017-06-01', '2017-07-01',
               '2017-08-01', '2017-09-01', '2017-10-01', '2017-11-01',
               '2017-12-01', '2018-01-01'],
              dtype='datetime64[ns]', name='DATE', length=397, freq=None)

# Window Functions

### 1) shift()

Shift index by desired number of periods

In [190]:
df2['Lag1'] = df2 ['Value'].shift(1)
df2['Lag2'] = df2 ['Value'].shift(2)
df2.head()

              Value     Lag1     Lag2
DATE
1985-01-01  72.5052      NaN      NaN
1985-02-01  70.6720  72.5052      NaN
1985-03-01  62.4502  70.6720  72.5052
1985-04-01  57.4714  62.4502  70.6720
1985-05-01  55.3151  57.4714  62.4502

### 2) Difference

In [195]:
df2['Diff1_m1'] = df2 ['Value'].diff(1)
df2['Diff1_m2'] = df2 ['Value'] - df2['Lag1']
df2.head()

              Value     Lag1     Lag2  Diff1_m1  Diff1_m2
DATE
1985-01-01  72.5052      NaN      NaN       NaN       NaN
1985-02-01  70.6720  72.5052      NaN   -1.8332   -1.8332
1985-03-01  62.4502  70.6720  72.5052   -8.2218   -8.2218
1985-04-01  57.4714  62.4502  70.6720   -4.9788   -4.9788
1985-05-01  55.3151  57.4714  62.4502   -2.1563   -2.1563

In [197]:
print(62.4502 - 70.6720)

-8.221799999999995

In [199]:
df1['Diff2'] = df1['Value'].diff(2)
df1.head()

        DATE    Value  Year  Quarter  Month  Day    Diff2
0 1985-01-01  72.5052  1985        1      1    1      NaN
1 1985-02-01  70.6720  1985        1      2    1      NaN
2 1985-03-01  62.4502  1985        1      3    1 -10.0550
3 1985-04-01  57.4714  1985        2      4    1 -13.2006
4 1985-05-01  55.3151  1985        2      5    1  -7.1351

# Rolling Functions

In [204]:
df1['Roll_mean2'] = df1['Value'].rolling(2).mean()
df1['Roll_mean3'] = df1['Value'].rolling(3).mean()
df1.head()

,DATE,Value,Year,Quarter,Month,Day,Diff2,Roll_mean2,Roll_mean3
0,1985-01-01,72.5052,1985,1,1,1,NaN,NaN,NaN
1,1985-02-01,70.6720,1985,1,2,1,NaN,71.58860,NaN
2,1985-03-01,62.4502,1985,1,3,1,-10.0550,66.56110,68.542467
3,1985-04-01,57.4714,1985,2,4,1,-13.2006,59.96080,63.531200
4,1985-05-01,55.3151,1985,2,5,1,-7.1351,56.39325,58.412233

In [206]:
print((72.5052 + 70.6720) / 2)
print((72.5052 + 70.6720 + 62.4502) / 3)

71.5886
68.54246666666667

## Creating Dates

In [209]:
# freq = D = days
d1 = pd.date_range(start = '2022-07-10', freq = 'D', periods = 10)
d1

DatetimeIndex(['2022-07-10', '2022-07-11', '2022-07-12', '2022-07-13',
               '2022-07-14', '2022-07-15', '2022-07-16', '2022-07-17',
               '2022-07-18', '2022-07-19'],
              dtype='datetime64[ns]', freq='D')

In [211]:
# freq = MS = first day of month
d2 = pd.date_range(start = '2022-07-01', freq = 'MS', periods = 12)
d2

DatetimeIndex(['2022-07-01', '2022-08-01', '2022-09-01', '2022-10-01',
               '2022-11-01', '2022-12-01', '2023-01-01', '2023-02-01',
               '2023-03-01', '2023-04-01', '2023-05-01', '2023-06-01'],
              dtype='datetime64[ns]', freq='MS')

In [215]:
# freq = ME = last day of month
d3 = pd.date_range(start = '2022-07-10', freq = 'ME', periods = 10)
d3

DatetimeIndex(['2022-07-31', '2022-08-31', '2022-09-30', '2022-10-31',
               '2022-11-30', '2022-12-31', '2023-01-31', '2023-02-28',
               '2023-03-31', '2023-04-30'],
              dtype='datetime64[ns]', freq='ME')

In [217]:
# freq = QS = quarter
d4 = pd.date_range(start = '2022-07-10', freq = 'QS', periods = 10)
d4

DatetimeIndex(['2022-10-01', '2023-01-01', '2023-04-01', '2023-07-01',
               '2023-10-01', '2024-01-01', '2024-04-01', '2024-07-01',
               '2024-10-01', '2025-01-01'],
              dtype='datetime64[ns]', freq='QS-JAN')

In [219]:
d5 = pd.date_range(start = '2022-01-01', end = '2022-04-15')
d5

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10',
               ...
               '2022-04-06', '2022-04-07', '2022-04-08', '2022-04-09',
               '2022-04-10', '2022-04-11', '2022-04-12', '2022-04-13',
               '2022-04-14', '2022-04-15'],
              dtype='datetime64[ns]', length=105, freq='D')

In [221]:
d6 = pd.date_range(start = '2022-01-01', end = '2022-11-15', freq ='MS')
d6

DatetimeIndex(['2022-01-01', '2022-02-01', '2022-03-01', '2022-04-01',
               '2022-05-01', '2022-06-01', '2022-07-01', '2022-08-01',
               '2022-09-01', '2022-10-01', '2022-11-01'],
              dtype='datetime64[ns]', freq='MS')